{"config": {"name": "sequential_1", "layers": [{"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "activation": "relu", "name": "conv2d_1", "kernel_constraint": null, "filters": 16, "batch_input_shape": [null, 28, 28, 1], "data_format": "channels_last", "padding": "valid", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "conv2d_2", "kernel_constraint": null, "filters": 32, "padding": "valid", "strides": [1, 1], "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activation": "relu", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "seed": null, "rate": 0.25, "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_1", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "seed": null, "rate": 0.5, "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_2", "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 10, "activation": "softmax", "activity_regularizer": null, "bias_regularizer": null}, "class_name": "Dense"}]}, "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4"}