{"config": {"name": "sequential_1", "layers": [{"config": {"dilation_rate": [1, 1], "name": "conv2d_1", "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "filters": 16, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "valid", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "dtype": "float32", "activation": "relu", "use_bias": true, "kernel_constraint": null, "batch_input_shape": [null, 28, 28, 1], "kernel_size": [3, 3], "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"dilation_rate": [1, 1], "name": "conv2d_2", "bias_constraint": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "filters": 32, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"units": 128, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "use_bias": true, "kernel_constraint": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"units": 10, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "activation": "softmax", "use_bias": true, "kernel_constraint": null, "bias_constraint": null}, "class_name": "Dense"}]}, "backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential"}