{"keras_version": "2.2.4", "config": {"name": "sequential_1", "build_input_shape": [null, 28, 28, 1], "layers": [{"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 128, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 128, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "activation": "softmax", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 10, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "dense_3"}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow"}