{"class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "units": 128, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "units": 128, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_regularizer": null, "activation": "softmax", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "units": 10, "bias_regularizer": null}}], "build_input_shape": [null, 28, 28, 1]}}