{"class_name": "Sequential", "backend": "tensorflow", "config": {"build_input_shape": [null, 28, 28, 1], "layers": [{"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "name": "dense_1", "units": 10, "trainable": true}}], "name": "sequential_1"}, "keras_version": "2.2.4"}