{"keras_version": "2.2.4", "backend": "tensorflow", "config": {"layers": [{"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "units": 128, "trainable": true}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "units": 128, "trainable": true}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activation": "softmax", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "dense_3", "kernel_regularizer": null, "units": 10, "trainable": true}, "class_name": "Dense"}], "build_input_shape": [null, 28, 28, 1], "name": "sequential_1"}, "class_name": "Sequential"}