{"class_name": "Sequential", "backend": "tensorflow", "config": {"build_input_shape": [null, 28, 28, 1], "name": "sequential_1", "layers": [{"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_regularizer": null, "units": 512, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "bias_regularizer": null, "units": 256, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "bias_regularizer": null, "units": 128, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_4", "bias_regularizer": null, "units": 10, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null}}]}, "keras_version": "2.2.4"}