{"class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow", "config": {"layers": [{"class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2d_1", "batch_input_shape": [null, 28, 28, 1], "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "dtype": "float32", "activation": "relu", "filters": 8}}, {"class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2d_2", "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "filters": 16}}, {"class_name": "Conv2D", "config": {"trainable": true, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2d_3", "activity_regularizer": null, "strides": [1, 1], "padding": "valid", "activation": "relu", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "filters": 16}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "noise_shape": null, "seed": null, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "units": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "noise_shape": null, "seed": null, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "activation": "softmax", "bias_regularizer": null, "units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "name": "dense_2"}}], "name": "sequential_1"}}