{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Conv2D", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "filters": 32, "name": "conv2d_1", "dtype": "float32", "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "batch_input_shape": [null, 28, 28, 1], "padding": "valid", "activation": "relu", "use_bias": true}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "filters": 32, "name": "conv2d_2", "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "padding": "valid", "activation": "relu", "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.25, "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "dense_1", "kernel_constraint": null, "units": 128, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.5, "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "dense_2", "kernel_constraint": null, "units": 10, "activation": "softmax", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true}}], "name": "sequential_1"}}