{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"layers": [{"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "relu", "padding": "valid", "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "name": "conv2d_1", "use_bias": true, "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_size": [3, 3], "trainable": true, "data_format": "channels_last", "dtype": "float32", "dilation_rate": [1, 1], "kernel_constraint": null, "batch_input_shape": [null, 28, 28, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "padding": "valid", "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_2", "use_bias": true, "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "activation": "relu", "padding": "valid", "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_3", "use_bias": true, "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "kernel_size": [3, 3], "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "rate": 0.25, "seed": null, "noise_shape": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "name": "dense_1", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "units": 128, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.5, "seed": null, "noise_shape": null, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "softmax", "activity_regularizer": null, "name": "dense_2", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "units": 10, "kernel_constraint": null}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential"}