{"class_name": "Sequential", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "trainable": true, "use_bias": true, "batch_input_shape": [null, 28, 28, 1], "bias_regularizer": null, "activation": "relu", "filters": 8, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "filters": 8, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "padding": "valid", "data_format": "channels_last", "kernel_size": [3, 3], "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "dtype": "float32", "trainable": true, "use_bias": true, "batch_input_shape": [null, 28, 28, 1], "bias_regularizer": null, "activation": "relu", "filters": 16, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "padding": "valid", "activity_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "trainable": true, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "filters": 16, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "padding": "valid", "data_format": "channels_last", "kernel_size": [3, 3], "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_constraint": null, "units": 128, "trainable": true, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "noise_shape": null, "seed": null, "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_2", "kernel_constraint": null, "units": 10, "trainable": true, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "bias_constraint": null}}]}, "backend": "tensorflow"}