{"keras_version": "2.2.4", "config": {"layers": [{"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "name": "dense_1", "bias_constraint": null, "activation": "softmax", "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 10, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}], "build_input_shape": [null, 28, 28, 1], "name": "sequential_1"}, "backend": "tensorflow", "class_name": "Sequential"}